Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.GetResultObjectIds Method
 Get ID numbers of objects with results.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<int> GetResultObjectIds(
	AnalysisResult.ObjectTypeEnum objectType
)
Public Shared Function GetResultObjectIds (
	objectType As AnalysisResult.ObjectTypeEnum
) As List(Of Integer)
Parameters
objectType
Type: Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum
The object type.
Return Value
Type: List<Int32>
The ID numbers of objects with results.
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace